zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/src/stm32mp1xx_hal_usart.c
  /* Reset errorCode */
  husart->ErrorCode = HAL_USART_ERROR_NONE;

  /* Clear the Error flags in the ICR register */
  __HAL_USART_CLEAR_FLAG(husart, USART_CLEAR_OREF | USART_CLEAR_NEF | USART_CLEAR_PEF | USART_CLEAR_FEF);

  /* Restore husart->State to Ready */
  husart->State = HAL_USART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Complete Callback */
  husart->AbortCpltCallback(husart);
#else
  /* Call legacy weak Abort Complete Callback */
  HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */

}


/**
  * @brief  DMA USART Rx communication abort callback, when initiated by user
  *         (To be called at end of DMA Rx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Tx DMA Handle.
  * @param  hdma DMA handle.
  * @retval None
  */
static void USART_DMARxAbortCallback(DMA_HandleTypeDef *hdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hdma->Parent);

  husart->hdmarx->XferAbortCallback = NULL;

  /* Check if an Abort process is still ongoing */
  if (husart->hdmatx != NULL)
  {
    if (husart->hdmatx->XferAbortCallback != NULL)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All DMA channels are aborted, call user Abort Complete callback */
  husart->TxXferCount = 0U;
  husart->RxXferCount = 0U;

  /* Reset errorCode */
  husart->ErrorCode = HAL_USART_ERROR_NONE;

  /* Clear the Error flags in the ICR register */
  __HAL_USART_CLEAR_FLAG(husart, USART_CLEAR_OREF | USART_CLEAR_NEF | USART_CLEAR_PEF | USART_CLEAR_FEF);

  /* Restore husart->State to Ready */
  husart->State  = HAL_USART_STATE_READY;

  /* Call user Abort complete callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  /* Call registered Abort Complete Callback */
  husart->AbortCpltCallback(husart);
#else
  /* Call legacy weak Abort Complete Callback */
  HAL_USART_AbortCpltCallback(husart);
#endif /* USE_HAL_USART_REGISTER_CALLBACKS */
}

/**
  * @brief  MDMA USART transmit process complete callback.
  * @param  hmdma MDMA handle.
  * @retval None
  */
static void USART_MDMATransmitCplt(MDMA_HandleTypeDef *hmdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hmdma->Parent);

  if (husart != NULL)
  {
    husart->TxXferCount = 0U;

    if (husart->State == HAL_USART_STATE_BUSY_TX)
    {
      /* Disable the MDMA transfer for transmit request by resetting the DMAT bit
         in the USART CR3 register */
      CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

      /* Enable the USART Transmit Complete Interrupt */
      SET_BIT(husart->Instance->CR1, USART_CR1_TCIE);
    }
    else
    {
      if (husart->State == HAL_USART_STATE_BUSY_TX)
      {
        /* Call registered Tx Complete Callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
        husart->TxCpltCallback(husart);
#else
        HAL_USART_TxCpltCallback(husart);
#endif
      }
    }
  }
}

/**
  * @brief MDMA USART receive process complete callback.
  * @param  hmdma MDMA handle.
  * @retval None
  */
static void USART_MDMAReceiveCplt(MDMA_HandleTypeDef *hmdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hmdma->Parent);

  /* MDMA Normal mode */
  if (husart != NULL)
  {
    husart->RxXferCount = 0U;

    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(husart->Instance->CR1, USART_CR1_PEIE);
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_EIE);

    /* Disable the MDMA RX transfer for the receiver request by resetting the DMAR bit
       in USART CR3 register */
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAR);
    /* similarly, disable the MDMA TX transfer that was started to provide the
       clock to the slave device */
    CLEAR_BIT(husart->Instance->CR3, USART_CR3_DMAT);

    if (husart->State == HAL_USART_STATE_BUSY_RX)
    {
      /* Call registered Rx Complete Callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      husart->RxCpltCallback(husart);
#else
      HAL_USART_RxCpltCallback(husart);
#endif
    }
    /* The USART state is HAL_USART_STATE_BUSY_TX_RX */
    else
    {
      /* Call registered Tx Rx Complete Callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
      husart->TxRxCpltCallback(husart);
#else
      HAL_USART_TxRxCpltCallback(husart);
#endif
    }
    husart->State = HAL_USART_STATE_READY;
  }
}

/**
  * @brief MDMA USART communication error callback.
  * @param  hmdma MDMA handle.
  * @retval None
  */
static void USART_MDMAError(MDMA_HandleTypeDef *hmdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hmdma->Parent);

  if (husart != NULL)
  {
    husart->RxXferCount = 0U;
    husart->TxXferCount = 0U;
    USART_EndTransfer(husart);

    husart->ErrorCode |= HAL_USART_ERROR_DMA;
    husart->State = HAL_USART_STATE_READY;

    /* Call registered Error Callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
    husart->ErrorCallback(husart);
#else
    HAL_USART_ErrorCallback(husart);
#endif
  }
}

/**
  * @brief  MDMA USART communication abort callback, when initiated by HAL services on Error
  *         (To be called at end of MDMA Abort procedure following error occurrence).
  * @param  hmdma MDMA handle.
  * @retval None
  */
static void USART_MDMAAbortOnError(MDMA_HandleTypeDef *hmdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hmdma->Parent);
  husart->RxXferCount = 0U;
  husart->TxXferCount = 0U;

  /* Call registered Error Callback */
#if (USE_HAL_USART_REGISTER_CALLBACKS == 1)
  husart->ErrorCallback(husart);
#else
  HAL_USART_ErrorCallback(husart);
#endif
}

/**
  * @brief  MDMA USART Tx communication abort callback, when initiated by user
  *         (To be called at end of MDMA Tx Abort procedure following user abort request).
  * @note   When this callback is executed, User Abort complete call back is called only if no
  *         Abort still ongoing for Rx MDMA Handle.
  * @param  hmdma MDMA handle.
  * @retval None
  */
static void USART_MDMATxAbortCallback(MDMA_HandleTypeDef *hmdma)
{
  USART_HandleTypeDef *husart = (USART_HandleTypeDef *)(hmdma->Parent);

  husart->hmdmatx->XferAbortCallback = NULL;

  /* Check if an Abort process is still ongoing */
  if (husart->hmdmarx != NULL)
  {
    if (husart->hmdmarx->XferAbortCallback != NULL)
    {
      return;
    }
  }

  /* No Abort process still ongoing : All MDMA channels are aborted, call user Abort Complete callback */
  husart->TxXferCount = 0U;
  husart->RxXferCount = 0U;

